12/data/attachments/7d0742e5aa3d1bca.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7984fc7a-05c9-4a1e-a54f-bfeba629a358</nif:username>
            <nif:friendToBeAdded>Tracy_scientist_Friend_9100_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>